## SQL at Scale with Spark SQL

Welcome to the SQL mini project. For this project, you will use the Domino Data Lab Platform and work through a series of exercises using Spark SQL. The dataset size may not be too big but the intent here is to familiarize yourself with the Spark SQL interface which scales easily to huge datasets, without you having to worry about changing your SQL queries. 

The data you need is present in the mini-project folder in the form of three CSV files. You need to make sure that these datasets are uploaded and present in the same directory as this notebook file, since we will be importing these files in Spark and create the following tables under the __`country_club`__ database using Spark SQL.

1. The __`bookings`__ table,
2. The __`facilities`__ table, and
3. The __`members`__ table.

You will be uploading these datasets shortly into Spark to understand how to create a database within minutes! Once the database and the tables are populated, you will be focusing on the mini-project questions.

In the mini project, you'll be asked a series of questions. You can solve them using the Domino platform, but for the final deliverable, please download this notebook as an IPython notebook (__`File -> Export -> IPython Notebook`__) and upload it to your GitHub.

# Checking Existence of Spark Environment Variables

Make sure your notebook is loaded using a PySpark Workspace. If you open up a regular Jupyter workspace the following variables might not exist

In [1]:
spark

In [2]:
sqlContext

### Run the following if you failed to open a notebook in the PySpark Workspace

This will work assuming you are using Spark in the cloud on domino or you might need to configure with your own spark instance if you are working offline

In [3]:
if 'sc' not in locals():
    from pyspark.context import SparkContext
    from pyspark.sql.context import SQLContext
    from pyspark.sql.session import SparkSession
    
    sc = SparkContext()
    sqlContext = SQLContext(sc)
    spark = SparkSession(sc)

# Create a utility function to run SQL commands

Instead of typing the same python functions repeatedly, we build a small function where you can just pass your query to get results.

- Remember we are using Spark SQL in PySpark
- We can't run multiple SQL statements in one go (no semi-colon ';' separated SQL statements)
- We can run multi-line SQL queries (but still has to be a single statement)

In [6]:
def run_sql(statement):
    try:
        result = sqlContext.sql(statement)
    except Exception as e:
        print(e.desc, '\n', e.stackTrace)
        return
    return result

# Creating the Database

We will first create our database in which we will be creating our three tables of interest

In [25]:
run_sql('drop database if exists country_club cascade')
run_sql('create database country_club')
dbs = run_sql('show databases')
dbs.toPandas()

   databaseName
0  country_club
1       default

# Creating the Tables

In this section, we will be creating the three tables of interest and populate them with the data from the CSV files already available to you.

To get started, first make sure you have already uploaded the three CSV files and they are present in the same directory as the notebook.

Once you have done this, please remember to execute the following code to build the dataframes which will be saved as tables in our database

In [27]:
# File location and type
file_location_bookings = "./Bookings.csv"
file_location_facilities = "./Facilities.csv"
file_location_members = "./Members.csv"

file_type = "csv"

# CSV options
infer_schema = "true"
first_row_is_header = "true"
delimiter = ","

# The applied options are for CSV files. For other file types, these will be ignored.
bookings_df = (spark.read.format(file_type) 
                    .option("inferSchema", infer_schema) 
                    .option("header", first_row_is_header) 
                    .option("sep", delimiter) 
                    .load(file_location_bookings))

facilities_df = (spark.read.format(file_type) 
                      .option("inferSchema", infer_schema) 
                      .option("header", first_row_is_header) 
                      .option("sep", delimiter) 
                      .load(file_location_facilities))

members_df = (spark.read.format(file_type) 
                      .option("inferSchema", infer_schema) 
                      .option("header", first_row_is_header) 
                      .option("sep", delimiter) 
                      .load(file_location_members))

### Viewing the dataframe schemas

We can take a look at the schemas of our potential tables to be written to our database soon

In [28]:
print('Bookings Schema')
bookings_df.printSchema()
print('Facilities Schema')
facilities_df.printSchema()
print('Members Schema')
members_df.printSchema()

Bookings Schema
root
 |-- bookid: integer (nullable = true)
 |-- facid: integer (nullable = true)
 |-- memid: integer (nullable = true)
 |-- starttime: timestamp (nullable = true)
 |-- slots: integer (nullable = true)

Facilities Schema
root
 |-- facid: integer (nullable = true)
 |-- name: string (nullable = true)
 |-- membercost: double (nullable = true)
 |-- guestcost: double (nullable = true)
 |-- initialoutlay: integer (nullable = true)
 |-- monthlymaintenance: integer (nullable = true)

Members Schema
root
 |-- memid: integer (nullable = true)
 |-- surname: string (nullable = true)
 |-- firstname: string (nullable = true)
 |-- address: string (nullable = true)
 |-- zipcode: integer (nullable = true)
 |-- telephone: string (nullable = true)
 |-- recommendedby: integer (nullable = true)
 |-- joindate: timestamp (nullable = true)

# Create permanent tables
We will be creating three permanent tables here in our __`country_club`__ database as we discussed previously with the following code

In [29]:
permanent_table_name_bookings = "country_club.Bookings"
bookings_df.write.format("parquet").saveAsTable(permanent_table_name_bookings)

permanent_table_name_facilities = "country_club.Facilities"
facilities_df.write.format("parquet").saveAsTable(permanent_table_name_facilities)

permanent_table_name_members = "country_club.Members"
members_df.write.format("parquet").saveAsTable(permanent_table_name_members)

### Refresh tables and check them

In [30]:
run_sql('use country_club')
run_sql('REFRESH table bookings')
run_sql('REFRESH table facilities')
run_sql('REFRESH table members')
tbls = run_sql('show tables')
tbls.toPandas()

       database   tableName  isTemporary
0  country_club    bookings        False
1  country_club  facilities        False
2  country_club     members        False

# Test a sample SQL query

__Note:__ You can use multi-line SQL queries (but still a single statement) as follows

In [31]:
result = run_sql('''
                    SELECT * 
                    FROM bookings 
                    LIMIT 3
                 ''')
result.toPandas()

   bookid  facid  memid           starttime  slots
0       0      3      1 2012-07-03 11:00:00      2
1       1      4      1 2012-07-03 08:00:00      2
2       2      6      0 2012-07-03 18:00:00      2

# Your Turn: Solve the following questions with Spark SQL

- Make use of the `run_sql(...)` function as seen in the previous example
- You can write multi-line SQL queries but it has to be a single statement (no use of semi-colons ';')
- Make use of the `toPandas()` function as depicted in the previous example to display the query results

#### Q1: Some of the facilities charge a fee to members, but some do not. Please list the names of the facilities that do.

In [33]:
result = run_sql('''
                   select *
                   from facilities
                   where membercost = 0
                 ''')
result.toPandas()

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,2,Badminton Court,0.0,15.5,4000,50
1,3,Table Tennis,0.0,5.0,320,10
2,7,Snooker Table,0.0,5.0,450,15
3,8,Pool Table,0.0,5.0,400,15

####  Q2: How many facilities do not charge a fee to members?

In [35]:
result = run_sql('''
                   select count(*)
                   from facilities
                   where membercost = 0
                 ''')
result.toPandas()

   count(1)
0         4

#### Q3: How can you produce a list of facilities that charge a fee to members, where the fee is less than 20% of the facility's monthly maintenance cost? 
#### Return the facid, facility name, member cost, and monthly maintenance of the facilities in question.

In [51]:
result = run_sql('''
                   select facid, name, membercost, monthlymaintenance
                   from facilities
                   where facid in
                   (select facid
                   from facilities
                   where membercost < (.2 * monthlymaintenance))
                   and membercost > 0
                ''')
result.toPandas()

   facid            name  membercost  monthlymaintenance
0      0  Tennis Court 1         5.0                 200
1      1  Tennis Court 2         5.0                 200
2      4  Massage Room 1         9.9                3000
3      5  Massage Room 2         9.9                3000
4      6    Squash Court         3.5                  80

#### Q4: How can you retrieve the details of facilities with ID 1 and 5? Write the query without using the OR operator.

In [52]:
result = run_sql('''
                   select *
                   from facilities
                   where facid = 1 or facid = 5
                ''')
result.toPandas()

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,1,Tennis Court 2,5.0,25.0,8000,200
1,5,Massage Room 2,9.9,80.0,4000,3000

#### Q5: How can you produce a list of facilities, with each labelled as 'cheap' or 'expensive', depending on if their monthly maintenance cost is more than $100? 
#### Return the name and monthly maintenance of the facilities in question.

In [54]:
result = run_sql('''
                   select name, monthlymaintenance,
                       case 
                           when monthlymaintenance > 100 then 'expensive'
                           when monthlymaintenance < 100 then 'cheap'
                       end as maintenance_description
                   from facilities
                 ''')
result.toPandas()

              name  monthlymaintenance maintenance_description
0   Tennis Court 1                 200               expensive
1   Tennis Court 2                 200               expensive
2  Badminton Court                  50                   cheap
3     Table Tennis                  10                   cheap
4   Massage Room 1                3000               expensive
5   Massage Room 2                3000               expensive
6     Squash Court                  80                   cheap
7    Snooker Table                  15                   cheap
8       Pool Table                  15                   cheap

#### Q6: You'd like to get the first and last name of the last member(s) who signed up. Do not use the LIMIT clause for your solution.

In [62]:
result = run_sql('''
                    select surname as Last, firstname as First, joindate as Joined 
                    from members
                    order by joindate desc
                 ''')
result.toPandas()

                 Last      First              Joined
0               Smith     Darren 2012-09-26 18:08:45
1             Crumpet      Erica 2012-09-22 08:36:38
2                Hunt       John 2012-09-19 11:32:45
3          Tupperware   Hyacinth 2012-09-18 19:32:05
4             Purview  Millicent 2012-09-18 19:04:01
5   Worthington-Smyth      Henry 2012-09-17 12:27:15
6             Farrell      David 2012-09-15 08:22:05
7              Rumney  Henrietta 2012-09-05 08:42:35
8               Jones    Douglas 2012-09-02 18:43:05
9              Sarwin  Ramnaresh 2012-09-01 08:44:42
10             Coplin       Joan 2012-08-29 08:32:41
11          Mackenzie       Anna 2012-08-26 09:32:05
12            Genting    Matthew 2012-08-19 14:55:55
13             Pinker      David 2012-08-16 11:32:47
14              Baker    Timothy 2012-08-15 10:34:25
15              Bader   Florence 2012-08-10 17:52:03
16              Smith       Jack 2012-08-10 16:22:05
17            Farrell     Jemima 2012-08-10 14:28:01
18              Baker       Anne 2012-08-10 14:23:22
19              Jones      David 2012-08-06 16:32:55
20               Owen    Charles 2012-08-03 19:42:37
21           Stibbons     Ponder 2012-07-25 17:09:05
22             Boothe        Tim 2012-07-25 16:02:35
23               Dare      Nancy 2012-07-25 08:59:12
24              Tracy     Burton 2012-07-15 08:52:55
25            Butters     Gerald 2012-07-09 10:44:09
26           Joplette     Janice 2012-07-03 10:25:05
27             Rownam        Tim 2012-07-03 09:32:15
28              Smith      Tracy 2012-07-02 12:08:23
29              Smith     Darren 2012-07-02 12:02:05
30              GUEST      GUEST 2012-07-01 00:00:00

####  Q7: How can you produce a list of all members who have used a tennis court?
- Include in your output the name of the court, and the name of the member formatted as a single column. 
- Ensure no duplicate data
- Also order by the member name.

In [101]:
result = run_sql('''
                   select distinct f.name as Facility, concat(m.firstname,' ',m.surname) as Name 
                   from bookings as b
                   inner join facilities as f
                   using(facid)
                   inner join members as m
                   using(memid)
                   where f.name like 'Tennis Court%'
                   order by name
                 ''')
result.toPandas()

          Facility               Name
0   Tennis Court 2         Anne Baker
1   Tennis Court 1         Anne Baker
2   Tennis Court 2       Burton Tracy
3   Tennis Court 1       Burton Tracy
4   Tennis Court 1       Charles Owen
5   Tennis Court 2       Charles Owen
6   Tennis Court 2       Darren Smith
7   Tennis Court 2      David Farrell
8   Tennis Court 1      David Farrell
9   Tennis Court 2        David Jones
10  Tennis Court 1        David Jones
11  Tennis Court 1       David Pinker
12  Tennis Court 1      Douglas Jones
13  Tennis Court 1      Erica Crumpet
14  Tennis Court 1     Florence Bader
15  Tennis Court 2     Florence Bader
16  Tennis Court 2        GUEST GUEST
17  Tennis Court 1        GUEST GUEST
18  Tennis Court 2     Gerald Butters
19  Tennis Court 1     Gerald Butters
20  Tennis Court 2   Henrietta Rumney
21  Tennis Court 1         Jack Smith
22  Tennis Court 2         Jack Smith
23  Tennis Court 2    Janice Joplette
24  Tennis Court 1    Janice Joplette
25  Tennis Court 1     Jemima Farrell
26  Tennis Court 2     Jemima Farrell
27  Tennis Court 1        Joan Coplin
28  Tennis Court 1          John Hunt
29  Tennis Court 2          John Hunt
30  Tennis Court 1    Matthew Genting
31  Tennis Court 2  Millicent Purview
32  Tennis Court 1         Nancy Dare
33  Tennis Court 2         Nancy Dare
34  Tennis Court 1    Ponder Stibbons
35  Tennis Court 2    Ponder Stibbons
36  Tennis Court 2   Ramnaresh Sarwin
37  Tennis Court 1   Ramnaresh Sarwin
38  Tennis Court 1         Tim Boothe
39  Tennis Court 2         Tim Boothe
40  Tennis Court 1         Tim Rownam
41  Tennis Court 2         Tim Rownam
42  Tennis Court 2      Timothy Baker
43  Tennis Court 1      Timothy Baker
44  Tennis Court 2        Tracy Smith
45  Tennis Court 1        Tracy Smith

#### Q8: How can you produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than $30? 

- Remember that guests have different costs to members (the listed costs are per half-hour 'slot')
- The guest user's ID is always 0. 

#### Include in your output the name of the facility, the name of the member formatted as a single column, and the cost.

- Order by descending cost, and do not use any subqueries.

In [138]:
# result = run_sql('''
#                    select f.name, concat(m.firstname,' ',m.surname) as name,
#                    case 
#                    where memid = 0 then  
#                    from bookings as b
#                    inner join facilities as f
#                    using(facid)
#                    inner join members as m
#                    using(memid)
#                    where (membercost > 30 
#                    or guestcost > 30)
#                     and date_format(starttime, "y-M-d") = date_format(starttime, "y-M-d")
#                    order by membercost, guestcost desc
#                  ''')
result = run_sql('''
                   select f.name as Facility, concat(m.firstname,' ',m.surname) as Name, memid,
                   case
                       when memid = 0 then slots * guestcost
                       else slots * membercost
                   end as Cost
                   from bookings as b
                   inner join facilities as f
                   using(facid)
                   inner join members as m
                   using(memid)            
                   where 
                   case
                       when memid = 0 then slots * guestcost
                       else slots * membercost
                   end  > 30
                   and starttime like '%2012-09-14%'
                   order by cost desc
                 ''')
result.toPandas()

          Facility            Name  memid   Cost
0   Massage Room 2     GUEST GUEST      0  320.0
1   Massage Room 1     GUEST GUEST      0  160.0
2   Massage Room 1     GUEST GUEST      0  160.0
3   Massage Room 1     GUEST GUEST      0  160.0
4   Tennis Court 2     GUEST GUEST      0  150.0
5   Tennis Court 1     GUEST GUEST      0   75.0
6   Tennis Court 1     GUEST GUEST      0   75.0
7   Tennis Court 2     GUEST GUEST      0   75.0
8     Squash Court     GUEST GUEST      0   70.0
9   Massage Room 1  Jemima Farrell     13   39.6
10    Squash Court     GUEST GUEST      0   35.0
11    Squash Court     GUEST GUEST      0   35.0

#### Q9: This time, produce the same result as in Q8, but using a subquery.

In [135]:
result = run_sql('''
                    select f.name as Facility, concat(m.firstname,' ',m.surname) as Name, memid,starttime,
                   case
                       when memid = 0 then slots * guestcost
                       else slots * membercost
                   end as Cost
                   from bookings as b
                   inner join facilities as f
                   using(facid)
                   inner join members as m
                   using(memid)            
                   where memid in (
                       select memid, starttime
                       from bookings as b
                       inner join facilities as f
                       using(facid)
                       inner join members as m
                       using(memid)
                       groupy starttime
                       where starttime like '%2012-09-14%'
                   )
                   and 
                   case
                       when memid = 0 then slots * guestcost
                       else slots * membercost
                   end > 30
                   order by cost desc
                 ''')
result.toPandas()

mismatched input 'from' expecting <EOF>(line 7, pos 19)

== SQL ==

                    select f.name as Facility, concat(m.firstname,' ',m.surname) as Name, memid,starttime,
                   case
                       when memid = 0 then slots * guestcost
                       else slots * membercost
                   end as Cost
                   from bookings as b
-------------------^^^
                   inner join facilities as f
                   using(facid)
                   inner join members as m
                   using(memid)
                   where memid in (
                       select memid, starttime
                       from bookings as b
                       inner join facilities as f
                       using(facid)
                       inner join members as m
                       using(memid)
                       groupy starttime
                       where starttime like '%2012-09-14%'
                   )
                   and
                   case
                       when memid = 0 then slots * guestcost
                       else slots * membercost
                   end > 30
                   order by cost desc


 org.apache.spark.sql.catalyst.parser.ParseException.withCommand(ParseDriver.scala:241)
	 at org.apache.spark.sql.catalyst.parser.AbstractSqlParser.parse(ParseDriver.scala:117)
	 at org.apache.spark.sql.execution.SparkSqlParser.parse(SparkSqlParser.scala:48)
	 at org.apache.spark.sql.catalyst.parser.AbstractSqlParser.parsePlan(ParseDriver.scala:69)
	 at org.apache.spark.sql.SparkSession.sql(SparkSession.scala:642)
	 at sun.reflect.GeneratedMethodAccessor95.invoke(Unknown Source)
	 at sun.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:43)
	 at java.lang.reflect.Method.invoke(Method.java:498)
	 at py4j.reflection.MethodInvoker.invoke(MethodInvoker.java:244)
	 at py4j.reflection.ReflectionEngine.invoke(ReflectionEngine.java:357)
	 at py4j.Gateway.invoke(Gateway.java:282)
	 at py4j.commands.AbstractCommand.invokeMethod(AbstractCommand.java:132)
	 at py4j.commands.CallCommand.execute(CallCommand.java:79)
	 at py4j.GatewayConnection.run(GatewayConnection.java:238)
	 at java.lang.Thread.run(Thread.java:748)

AttributeError: 'NoneType' object has no attribute 'toPandas'

#### Q10: Produce a list of facilities with a total revenue less than 1000.
- The output should have facility name and total revenue, sorted by revenue. 
- Remember that there's a different cost for guests and members!

In [ ]:
result = run_sql('''
                    
                 ''')
result.toPandas()